# TrussType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..TrussType Property
Truss Class See Also
---
Retrieve/set an object that represents the type of the truss.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TrussType TrussType { get; set; }
```

Visual Basic
---
```text
Public Property TrussType As TrussType
	Get
	Set
```

Visual C++
---
```text
public:
property TrussType^ TrussType {
	TrussType^ get ();
	void set (TrussType^ value);
}
```

# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace